tests/convection/0/U

    /*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.2                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);


boundaryField
{
    patch0_half0
    {
        type cyclic;
    }
    patch0_half1
    {
        type cyclic;
    }
    patch1_half0
    {
        type fixedValue;
        value   uniform (100 0 0);
    }
    patch1_half1
    {
        type zeroGradient;
    }
    patch2_half0
    {
        type cyclic;
    }
    patch2_half1
    {
        type cyclic;
    }
}
