tests/convection/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    patch0_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          10000;
        startFace       19800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch0_half1;
    }
    patch0_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          10000;
        startFace       29800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch0_half0;
    }
    patch1_half0
    {
        type            patch;
        nFaces          100;
        startFace       39800;
    }
    patch1_half1
    {
        type            patch;
        nFaces          100;
        startFace       39900;
    }
    patch2_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       40000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch2_half1;
    }
    patch2_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       40100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch2_half0;
    }
)

// ************************************************************************* //
